12/data/attachments/7317229f4c3ad6d2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>James_her_Actions_40072_0</nif:username>
            <nif:friendToBeRequested>soap_actions_00d9716a-eed4-4b55-97cf-4fd95346d49a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>